meme_dict = {
            "Кринж": "Что-то очень странное или стыдное",
            "Лол": "Что-то очень смешное",
            'Кринж':  'ситуация или действие, вызывающие сильный стыд и неловкость («испанский стыд»)' ,
            'Краш':  'объект романтической влюбленности или симпатии',
            'Вайб':  'атмосфера, настроение или общее ощущение от места, человека или ситуации',
            'Имба': 'что-то превосходное, лучшее, несбалансированно крутое (из компьютерных игр)',
            'Чилить':  'отдыхать, расслабляться',
            'Рофлить':  'шутить, громко смеяться над чем-либо',
            'Пруф':  'доказательство или подтверждение слов (скриншот, ссылка, документ)',
            'Скуф':  'неопрятный мужчина старше 30 лет с пивным животом, который не следит за собой и критикует молодежь',
            'Сигма':  'независимый, самодостаточный мужчина, который держится вне традиционных социальных иерархий',
            'ПОВ (POV)':  'точка зрения (point of view), когда событие показывается от первого лица',
            'Чиназес':  'выражение полного одобрения, удовольствия или того, что всё идет отлично («отлично, пойдёт»)',
            
            }
word = input("Введите непонятное слово (первая буква большая!): ")
if word in meme_dict.keys():
   print("Значение слова:", meme_dict[word])
else:
   print("К сожалению, этого слова нет в словаре.")
